#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/shapeshed/asimo/runs/run-az1Vnwt95QLyEiTi

Waiting for the plan to start...

Terraform v1.1.4
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.__26eca8f67eb273a9cafb25ef1989fdf1_shapeshed_com_CNAME will be created
  + resource "aws_route53_record" "__26eca8f67eb273a9cafb25ef1989fdf1_shapeshed_com_CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_26eca8f67eb273a9cafb25ef1989fdf1.shapeshed.com"
      + records         = [
          + "_ac0f44f6b20b6d08d8683d23e8f24bce.xrchbtpdjs.acm-validations.aws.",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.__8e912589f272071e6beb0f31146b9819_www_shapeshed_com_CNAME will be created
  + resource "aws_route53_record" "__8e912589f272071e6beb0f31146b9819_www_shapeshed_com_CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_8e912589f272071e6beb0f31146b9819.www.shapeshed.com"
      + records         = [
          + "_2d7dea137e60e44fdb30e59e1e809008.xrchbtpdjs.acm-validations.aws.",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.__acme-challenge_shapeshed_com_TXT will be created
  + resource "aws_route53_record" "__acme-challenge_shapeshed_com_TXT" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_acme-challenge.shapeshed.com"
      + records         = [
          + "9ha6O94uBilOW30HXQb7Q-CnAOufb48Es7yF0GD4KfU",
        ]
      + ttl             = 60
      + type            = "TXT"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.d78e316caf6d1de59613b2e5a7e0d62b_shapeshed_com_CNAME will be created
  + resource "aws_route53_record" "d78e316caf6d1de59613b2e5a7e0d62b_shapeshed_com_CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "d78e316caf6d1de59613b2e5a7e0d62b.shapeshed.com"
      + records         = [
          + "verify.bing.com.",
        ]
      + ttl             = 86400
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.googlee87068e8125fba47_shapeshed_com_CNAME will be created
  + resource "aws_route53_record" "googlee87068e8125fba47_shapeshed_com_CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "googlee87068e8125fba47.shapeshed.com"
      + records         = [
          + "GOOGLE.com.",
        ]
      + ttl             = 86400
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.moxie_shapeshed_com_A will be created
  + resource "aws_route53_record" "moxie_shapeshed_com_A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "moxie.shapeshed.com"
      + records         = [
          + "173.255.248.188",
        ]
      + ttl             = 86400
      + type            = "A"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.moxie_shapeshed_com_AAAA will be created
  + resource "aws_route53_record" "moxie_shapeshed_com_AAAA" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "moxie.shapeshed.com"
      + records         = [
          + "2600:3c01::f03c:91ff:fe93:30f8",
        ]
      + ttl             = 86400
      + type            = "AAAA"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.shapeshed_com_A will be created
  + resource "aws_route53_record" "shapeshed_com_A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "shapeshed.com"
      + records         = [
          + "173.255.248.188",
        ]
      + ttl             = 3600
      + type            = "A"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.shapeshed_com_AAAA will be created
  + resource "aws_route53_record" "shapeshed_com_AAAA" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "shapeshed.com"
      + records         = [
          + "2600:3c01::f03c:91ff:fe93:30f8",
        ]
      + ttl             = 3600
      + type            = "AAAA"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.shapeshed_com_MX will be created
  + resource "aws_route53_record" "shapeshed_com_MX" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "shapeshed.com"
      + records         = [
          + "1 ASPMX.L.GOOGLE.COM",
          + "10 ALT3.ASPMX.L.GOOGLE.COM",
          + "10 ALT4.ASPMX.L.GOOGLE.COM",
          + "5 ALT1.ASPMX.L.GOOGLE.COM",
          + "5 ALT2.ASPMX.L.GOOGLE.COM",
        ]
      + ttl             = 3600
      + type            = "MX"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.shapeshed_com_NS will be created
  + resource "aws_route53_record" "shapeshed_com_NS" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "shapeshed.com"
      + records         = [
          + "ns-1025.awsdns-00.org.",
          + "ns-115.awsdns-14.com.",
          + "ns-1681.awsdns-18.co.uk.",
          + "ns-588.awsdns-09.net.",
        ]
      + ttl             = 172800
      + type            = "NS"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.shapeshed_com_SOA will be created
  + resource "aws_route53_record" "shapeshed_com_SOA" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "shapeshed.com"
      + records         = [
          + "ns-115.awsdns-14.com. awsdns-hostmaster.amazon.com. 1 7200 900 1209600 86400",
        ]
      + ttl             = 900
      + type            = "SOA"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.shapeshed_com_TXT will be created
  + resource "aws_route53_record" "shapeshed_com_TXT" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "shapeshed.com"
      + records         = [
          + "google-site-verification=VH4lMZXngyYKnvq-OftIaK7k83_HILU9XDozv4WppzU",
          + "v=spf1 include:_spf.google.com -all",
        ]
      + ttl             = 86400
      + type            = "TXT"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.shgsbo4u9t_shapeshed_com_CNAME will be created
  + resource "aws_route53_record" "shgsbo4u9t_shapeshed_com_CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "shgsbo4u9t.shapeshed.com"
      + records         = [
          + "zz.baidu.com.",
        ]
      + ttl             = 86400
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.w6yzyrt6eyqt_shapeshed_com_CNAME will be created
  + resource "aws_route53_record" "w6yzyrt6eyqt_shapeshed_com_CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "w6yzyrt6eyqt.shapeshed.com"
      + records         = [
          + "gv-h46mybslvl2p4v.dv.googlehosted.com.",
        ]
      + ttl             = 86400
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.yandex-verification_shapeshed_com_TXT will be created
  + resource "aws_route53_record" "yandex-verification_shapeshed_com_TXT" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "yandex-verification.shapeshed.com"
      + records         = [
          + "5dc1b233ee950ba7",
        ]
      + ttl             = 86400
      + type            = "TXT"
      + zone_id         = (known after apply)
    }

  # aws_route53_zone.shapeshed_com will be created
  + resource "aws_route53_zone" "shapeshed_com" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "shapeshed.com"
      + name_servers  = (known after apply)
      + tags_all      = (known after apply)
      + zone_id       = (known after apply)
    }

Plan: 17 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @shapeshed, Action: `pull_request`*